app/views/favorites/_favorite-btn.html.erb

  <%= form_with(model: @favorite, url: book_favorites_path(book), method: :delete) do |f| %>
    <%= f.submit "♥#{book.favorites.count}", class: "btn btn-link fas fa-heart heart_red"%>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

  <%= form_with(model: @favorite, url: book_favorites_path(book), method: :post) do |f| %>
    <%= f.submit "♡#{book.favorites.count}", class: "btn btn-link fas fa-heart heart_blue"%>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]