app/controllers/search_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE 'testuser1%')
SELECT "books".* FROM "books" WHERE "books"."title" = ?  [["title", "testbook1"]]
---
    def match(model, content)
      if model == 'user'
        User.where(name: content)
      elsif model == 'book'
        Book.where(title: content)